//============================================================================
// Name        : less_12_algorithmAndDataStructures.cpp
// Author      : andry antonenko
// IDE         : Eclipse IDE
// Description : lesson 12 of the algorithms and data structures course
//============================================================================

#include <iostream>
using namespace std;
//----------------------------------------------------------------------------
//#define NDEBUG // в начале файла исходного кода, перед включением заголовочного файла
#include <cassert>
//----------------------------------------------------------------------------

//----------------------------------------------------------------------------
/*
1. Написать функцию проверяющую
является ли переданное в неё бинарное дерево сбалансированным и
написать программу, которая:
- создаст [50] деревьев по [10000] узлов и
заполнит узлы случайными целочисленными значениями;
- рассчитает, какой процент из созданных деревьев является сбалансированными.
*/

//----------------------------------------------------------------------------
/*
Написать рекурсивную функцию бинарного поиска в дереве хранящемся в узлах, а не в массиве.

Результатом работы должен стать один файл с кодом на языке С,
содержащий функцию main и все необходимые функции.
*/

//----------------------------------------------------------------------------

//----------------------------------------------------------------------------
int main() {
//----------------------------------------------------------------------------
	cout << "" << endl; // prints 
//----------------------------------------------------------------------------
	return 0;
}
//----------------------------------------------------------------------------
